RIOT-OS/RIOT/cpu/efm32jg1b/include/efm32jg1b_devinfo.h
/**************************************************************************//**
 * @file efm32jg1b_devinfo.h
 * @brief EFM32JG1B_DEVINFO register and bit field definitions
 * @version 4.2.1
 ******************************************************************************
 * @section License
 * <b>Copyright 2015 Silicon Laboratories, Inc. http://www.silabs.com</b>
 ******************************************************************************
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software.@n
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.@n
 * 3. This notice may not be removed or altered from any source distribution.
 *
 * DISCLAIMER OF WARRANTY/LIMITATION OF REMEDIES: Silicon Laboratories, Inc.
 * has no obligation to support this Software. Silicon Laboratories, Inc. is
 * providing the Software "AS IS", with no express or implied warranties of any
 * kind, including, but not limited to, any implied warranties of
 * merchantability or fitness for any particular purpose or warranties against
 * infringement of any proprietary rights of a third party.
 *
 * Silicon Laboratories, Inc. will not be liable for any consequential,
 * incidental, or special damages, or any other relief, or for any claim by
 * any third party, arising from your use of this Software.
 *
 *****************************************************************************/#ifdef __cplusplus
extern "C" {
#endif

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFM32JG1B_DEVINFO
 * @{
 *****************************************************************************/

typedef struct
{
  __I uint32_t CAL;              /**< CRC of DI-page and calibration temperature  */
  uint32_t     RESERVED0[9];     /**< Reserved for future use **/
  __I uint32_t EUI48L;           /**< EUI48 OUI and Unique identifier  */
  __I uint32_t EUI48H;           /**< OUI  */
  __I uint32_t CUSTOMINFO;       /**< Custom information  */
  __I uint32_t MEMINFO;          /**< Flash page size and misc. chip information  */
  uint32_t     RESERVED1[2];     /**< Reserved for future use **/
  __I uint32_t UNIQUEL;          /**< Low 32 bits of device unique number  */
  __I uint32_t UNIQUEH;          /**< High 32 bits of device unique number  */
  __I uint32_t MSIZE;            /**< Flash and SRAM Memory size in kB  */
  __I uint32_t PART;             /**< Part description  */
  __I uint32_t DEVINFOREV;       /**< Device information page revision  */
  __I uint32_t EMUTEMP;          /**< EMU Temperature Calibration Information  */
  uint32_t     RESERVED2[2];     /**< Reserved for future use **/
  __I uint32_t ADC0CAL0;         /**< ADC0 calibration register 0  */
  __I uint32_t ADC0CAL1;         /**< ADC0 calibration register 1  */
  __I uint32_t ADC0CAL2;         /**< ADC0 calibration register 2  */
  __I uint32_t ADC0CAL3;         /**< ADC0 calibration register 3  */
  uint32_t     RESERVED3[4];     /**< Reserved for future use **/
  __I uint32_t HFRCOCAL0;        /**< HFRCO Calibration Register (4 MHz)  */
  uint32_t     RESERVED4[2];     /**< Reserved for future use **/
  __I uint32_t HFRCOCAL3;        /**< HFRCO Calibration Register (7 MHz)  */
  uint32_t     RESERVED5[2];     /**< Reserved for future use **/
  __I uint32_t HFRCOCAL6;        /**< HFRCO Calibration Register (13 MHz)  */
  __I uint32_t HFRCOCAL7;        /**< HFRCO Calibration Register (16 MHz)  */
  __I uint32_t HFRCOCAL8;        /**< HFRCO Calibration Register (19 MHz)  */
  uint32_t     RESERVED6[1];     /**< Reserved for future use **/
  __I uint32_t HFRCOCAL10;       /**< HFRCO Calibration Register (26 MHz)  */
  __I uint32_t HFRCOCAL11;       /**< HFRCO Calibration Register (32 MHz)  */
  __I uint32_t HFRCOCAL12;       /**< HFRCO Calibration Register (38 MHz)  */
  uint32_t     RESERVED7[11];    /**< Reserved for future use **/
  __I uint32_t AUXHFRCOCAL0;     /**< AUXHFRCO Calibration Register (4 MHz)  */
  uint32_t     RESERVED8[2];     /**< Reserved for future use **/
  __I uint32_t AUXHFRCOCAL3;     /**< AUXHFRCO Calibration Register (7 MHz)  */
  uint32_t     RESERVED9[2];     /**< Reserved for future use **/
  __I uint32_t AUXHFRCOCAL6;     /**< AUXHFRCO Calibration Register (13 MHz)  */
  __I uint32_t AUXHFRCOCAL7;     /**< AUXHFRCO Calibration Register (16 MHz)  */
  __I uint32_t AUXHFRCOCAL8;     /**< AUXHFRCO Calibration Register (19 MHz)  */
  uint32_t     RESERVED10[1];    /**< Reserved for future use **/
  __I uint32_t AUXHFRCOCAL10;    /**< AUXHFRCO Calibration Register (26 MHz)  */
  __I uint32_t AUXHFRCOCAL11;    /**< AUXHFRCO Calibration Register (32 MHz)  */
  __I uint32_t AUXHFRCOCAL12;    /**< AUXHFRCO Calibration Register (38 MHz)  */
  uint32_t     RESERVED11[11];   /**< Reserved for future use **/
  __I uint32_t VMONCAL0;         /**< VMON Calibration Register 0  */
  __I uint32_t VMONCAL1;         /**< VMON Calibration Register 1  */
  __I uint32_t VMONCAL2;         /**< VMON Calibration Register 2  */
  uint32_t     RESERVED12[3];    /**< Reserved for future use **/
  __I uint32_t IDAC0CAL0;        /**< IDAC0 Calibration Register 0  */
  __I uint32_t IDAC0CAL1;        /**< IDAC0 Calibration Register 1  */
  uint32_t     RESERVED13[2];    /**< Reserved for future use **/
  __I uint32_t DCDCLNVCTRL0;     /**< DCDC Low-noise VREF Trim Register 0  */
  __I uint32_t DCDCLPVCTRL0;     /**< DCDC Low-power VREF Trim Register 0  */
  __I uint32_t DCDCLPVCTRL1;     /**< DCDC Low-power VREF Trim Register 1  */
  __I uint32_t DCDCLPVCTRL2;     /**< DCDC Low-power VREF Trim Register 2  */
  __I uint32_t DCDCLPVCTRL3;     /**< DCDC Low-power VREF Trim Register 3  */
  __I uint32_t DCDCLPCMPHYSSEL0; /**< DCDC LPCMPHYSSEL Trim Register 0  */
  __I uint32_t DCDCLPCMPHYSSEL1; /**< DCDC LPCMPHYSSEL Trim Register 1  */
} DEVINFO_TypeDef;               /** @} */

/**************************************************************************//**
 * @defgroup EFM32JG1B_DEVINFO_BitFields
 * @{
 *****************************************************************************/

/* Bit fields for DEVINFO CAL */
#define _DEVINFO_CAL_MASK                                        0x00FFFFFFUL /**< Mask for DEVINFO_CAL */
#define _DEVINFO_CAL_CRC_SHIFT                                   0            /**< Shift value for CRC */
#define _DEVINFO_CAL_CRC_MASK                                    0xFFFFUL     /**< Bit mask for CRC */
#define _DEVINFO_CAL_TEMP_SHIFT                                  16           /**< Shift value for TEMP */
#define _DEVINFO_CAL_TEMP_MASK                                   0xFF0000UL   /**< Bit mask for TEMP */

